edchislo = {1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять", 6: "шесть", 7: "семь", 8: "восемь", 9: "девять"}
desyatki = {0: "десять", 1: "одиннадцать", 2: "двенадцать", 3: "тринадцать", 4: "четырнадцать", 5: "пятнадцать",
            6: "шестнадцать", 7: "семнадцать", 8: "восемнадцать", 9: "девятнадцать"}
desyatki2 = {2: "двадцать", 3: "тридцать", 4: "сорок", 5: "пятьдесят", 6: "шестьдесят", 7: "семдесят", 8: "восемдесят",
             9: "девяносто"}
N = 1


def colich(N):
    count = 0
    while N > 0:
        count += 1
        N = N // 10
    return count


def lego(N):
    j = N % 10
    if colich(N) == 1:
        print(edchislo[N])
    elif N >= 10 and N <= 19:
        print(desyatki[N % 10])
    elif N == 100:
        print("сто")
    else:
        print(desyatki2[N // 10], edchislo[N % 10])


def to99():
    N = 1
    for i in range(1,101):
        lego(N)
        N+=1

to99()

